<?php

$i ="40 -50 60 80 30 60 70";
$pass = 55;

$i = explode(" ", $i);

$ave = ($i[0]+$i[1]+$i[2]+$i[3]+$i[4]+$i[5]+$i[6])/7;

if (preg_match('/^[0-9]+$/', $i[0]) == 1 && preg_match('/^[0-9]+$/', $i[1]) == 1 && preg_match('/^[0-9]+$/', $i[2]) == 1 && preg_match('/^[0-9]+$/', $i[3]) == 1 && preg_match('/^[0-9]+$/', $i[4]) == 1 && preg_match('/^[0-9]+$/', $i[5]) == 1 && preg_match('/^[0-9]+$/', $i[6]) == 1) 
{
  if (0 <= $i[0] && $i[0] <=100 && 0 <= $i[1] && $i[1] <=100 && 0 <= $i[2] && $i[2] <=100 && 0 <= $i[3] && $i[3] <=100 && 0 <= $i[4] && $i[4] <=100 && 0 <= $i[5] && $i[5] <=100 && 0 <= $i[6] && $i[6] <=100) 
  {
    if (0 <= $pass && $pass <=100) 
    {
      if ($ave >= $pass) 
      {
        echo "合格です。";
      }
      else {
        echo "不合格です。";
      }
    }
    else 
    {
      echo "合格点を正しく（0以上100以下）入力してください。";
    }
  }
  else{
    echo "正しい点数（0以上100以下）を入力してください。";
  }
}
else 
{
  echo "正の整数を入力してください。(負の整数や小数点を含む数値を入力しないでください。)";
}

?>